"""
### 知识点回顾


* numpy知识点：
  * 功能强大n维数组
  * 精密的广播
  * 集成C、C++和Fortran（数学计算的语言）的代码
  * 强大的线性代数、傅里叶变换和随机数功能。


* opencv
  * 加载图片显示
  * 调整尺寸和颜色空间：黑白（灰度化处理）、hsv（便于计算）
  * 图片马赛克（本质是numpy数组操作）
  * 人脸检测（人脸特征）
  * 人脸贴纸画
  * opencv检测轮廓
  * 人脸轮廓替换：条件、位运算（本质也是条件）
  * opencv直方图，直方图是一种图形，分析图片中数据分布，画图显示
  * 图片振幅谱图（波动情况）
  * cv2、numpy中的傅里叶变换
  * 调用方法，时域----->频域
  * 滤波：低通滤波、高通滤波
  * 频（出现的次数，频率）
  * 低通滤波，保留低频，去除高频，噪声
  * 高通滤波，保留高频，过滤低频。
  * opencv视频保存，黑白、视频的压缩格式
  * 音乐操作，pydub是否可以操作
  * 音视频合成。
  * 合成任何视频和音频。



"""