from sklearn.svm import SVC
# 机器学习介绍与应用
# 机器学习，人工智能，AI
# 不仅仅是代码，超越代码，代码只是工具
# 人工智能，计算机'聪明'
# 经验 ------> 数据；经验 比智慧，智商重要！
# 多看书、行万里路，可以获取经验。
# 2016 AlphaGo 李世石，比赛
# AlphaGo 团队，比李世石，强大
# 算法，策略，不是死循环遍历
# 火车站，验票进站
# 开高铁，不是人了，无人驾驶
# 特斯拉、蔚来、汽车
# 手机应用：siri、手机助手、垃圾短信少
# 淘宝，每个人页面，不一样，千人前面，8亿，不是人做的，算法
# 根据每个人消费习惯
# 机器学习本质：数学 + 统计学 + 代码实现
# 考研方向，数学研究生，价值连城
# X**2 + Y**2 = Z**2 正整数解 无穷多个
# X**3 + Y**3 = Z**3 正整数解，琢磨，有吗？一个也没有！！！

# 你怕蛇吗？
# 为什么怕蛇？
# 蛇咬过你吗？
# 人进化，海里---->陆地----->爬行---->猴子---->人
# 蛇，很多年，吃小型爬行动物，蛇来了，跑路，害怕！知道害怕生存下来，
# 基因流传下去，分化，各种各样生物，其中有一只，就是人类，很多人依然怕蛇
# 基因决定，生物已经找到。脊椎层，无需思考，直接反应！
# 基因是什么：数据（生命换来的！）

# 数据、模型、算法
# 人脸数据 也是一种数据：faces（人脸数据）、target（是谁，目标值）
# 数据，有结构，要求，opencv算法对数据要求：三维可以
# 有些算法，要求数据必须是二维的
# 模型 == 算法，解决一类问题
# 数学建模，用数学构件模型。
# 算法 + 生物
# 算法 + 医疗
# 算法 + 医院、医生
# 包含了数据公式  + 概率论 + 信息熵 ------> 分析数据 ------> 得到结果
# 微众银行，微信中，支付----->微粒贷（企业培训），不能人为，所有一切都是算法，自动运行！
# 大数据分析，大部分都是这样。
# 支付宝，借呗，额度
# 都是通过算法，分配！


# 获取模型、训练集、测试集、训练模型
# opencv人脸验证的模型
# sklearn中模型 from sklearn.svm import SVC
# 训练集，拆分了 split_data()
# 测试集，验证，模型好不好！
# 训练好之后，模型实际使用。


# 澳门风云，赌场出老千吗？
# 从来不出老千！ 通过概率，挣钱！
# 数学问题。

